export const TEXTS = {
  terms: {
    title: 'Пользовательское соглашение',
    content: `<b>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ НА ИСПОЛЬЗОВАНИЕ VPN-СЕРВИСА</b><br><br>
<b>1. Общие положения</b><br><br>
1.1. Настоящее Пользовательское соглашение (далее – «Соглашение») регулирует отношения между пользователем (далее – «Пользователь») и владельцем VPN-сервиса (далее – «Лицензиар»).<br>
1.2. VPN-сервис предоставляется исключительно в целях обеспечения безопасного соединения, защиты персональных данных и конфиденциальности информации Пользователя в сети Интернет.<br>
1.3. Пользователь обязан ознакомиться с условиями настоящего Соглашения перед началом использования VPN-сервиса. Использование VPN-сервиса означает полное согласие с условиями Соглашения.<br><br><br>
<b>2. Правовые основания использования VPN-сервиса</b><br><br>
2.1. Лицензиар осуществляет деятельность в соответствии с законодательством Российской Федерации, включая:<br><br>
<ul>
<li>Федеральный закон от 27 июля 2006 г. № 149-ФЗ «Об информации, информационных технологиях и о защите информации»;</li>
<li>Федеральный закон от 6 июля 2016 г. № 374-ФЗ (пакет «Яровой»);</li>
<li>Федеральный закон от 31 июля 2023 г. № 406-ФЗ «Об информации, информационных технологиях и о защите информации» и Федеральный закон «О связи»;</li>
<li>Постановление от 12 февраля 2020 г. № 127 «Об утверждении Правил централизованного управления сетью связи общего пользования»;</li>
<li>Федеральный закон от 29 июля 2017 г. № 276-ФЗ «О внесении изменений в Федеральный закон "Об информации, информационных технологиях и о защите информации"», устанавливающий запрет на использование информационно-телекоммуникационных сетей для доступа к запрещенным ресурсам;</li>
<li>Приказ Роскомнадзора от 30 ноября 2024 г., запрещающий распространение научной, научно-технической и статистиической информации о VPN-сервисах, используемых для обхода блокировок, за исключением информации, предназначенной для обеспечения безопасного удаленного доступа.</li>
</ul><br>
2.2. Лицензиар не предоставляет доступ к ресурсам, запрещенным на территории Российской Федерации, и не предназначен для обхода блокировок, установленных органами государственной власти.<br>
2.3. Лицензиар оставляет за собой право ограничивать доступ к сервису в случаях нарушения законодательства Российской Федерации.<br><br><br>
<b>3. Ограничения и ответственность пользователя</b><br><br>
3.1. Пользователь обязуется:<br><br>
<ul>
<li>Не использовать VPN-сервис для обхода блокировок, установленных в соответствии с законодательством РФ.</li>
<li>Не распространять противоправную информацию, включая экстремистские материалы, пропаганду насилия, наркотиков и другую запрещённую контентную информацию.</li>
<li>Не осуществлять хакерскую деятельность, не нарушать работу информационных систем и не совершать кибератаки.</li>
<li>Не использовать VPN-сервис для анонимного доступа к запрещённым ресурсам.</li>
</ul><br>
3.2. В случае нарушения данных условий Лицензиар вправе приостановить или прекратить доступ к сервису без предварительного уведомления.<br><br><br>
<b>4. Политика конфиденциальности</b><br><br>
4.1. Лицензиар соблюдает требования законодательства РФ в области защиты персональных данных.<br>
4.2. Лицензиар не ведёт учёт действий Пользователей в сети Интернет, за исключением случаев, предусмотренных законодательством РФ.<br>
4.3. Лицензиар вправе передавать данные государственных органов Российской Федерации в случае поступления соответствующих запросов в порядке, установленным законом.<br><br><br>
<b>5. Ограничение ответственности</b><br><br>
5.1. Лицензиар не несёт ответственности за использование VPN-сервиса Пользователем в целях, противоречащих законодательству РФ.<br>
5.2. VPN-сервис предоставляется «как есть», без каких-либо гарантий работоспособности, доступности или совместимости с определёнными устройствами или программным обеспечением.<br>
5.3. Лицензиар не несёт ответственности за возможные технические сбои, вызванные действиями третьих лиц или проблемами на стороне Пользователя.<br><br><br>
<b>6. Заключительные положения</b><br><br>
6.1. Лицензиар оставляет за собой право вносить изменения в настоящее Соглашение в одностороннем порядке.<br>
6.2. Актуальная версия Соглашения размещается на официальных ресурсах Лицензиара.<br>
6.3. Вопросы, не урегулированные настоящим Соглашением, регулируются действующим законодательством Российской Федерации.<br><br>
<i>Дата последнего обновления: 10 февраля 2025 г.</i>`
  },
setup: {
    manualPC: {
      title: 'Инструкция для ПК',
      content: key => `<b>Инструкция по установке и использованию WSocks VPN на базе WSocks VPN / NekoBox / Ray для Windows 10/11.</b><br><br>
<b>Ссылка на видео инструкцию: <a href="https://plvideo.ru/watch?v=fGzKBtY-KmfW" class="link">https://plvideo.ru/watch?v=fGzKBtY-KmfW</a></b><br><br>
<b>Для использования программы WSocks VPN / NekoBox / Ray:</b><br><br>
<ul>
<li>Скачиваем zip файл для установки WSocks VPN по кнопке "Скачать" в самом низу.</li>
<li>Переносим папку "WSocks-VPN--NekoBox--main" из zip архива в любое удобное место (на рабочий стол).</li>
<li>Запускаем "WSocks VPN.exe" от имени администратора.</li>
<li>Копируем ключ подключения:<br>
<pre><code class="clickable-key" onclick="navigator.clipboard.writeText(this.innerText).then(() => alert('Ключ скопирован')).catch(err => console.error('Ошибка:', err))"><span class="clickable-manual">${key}</span></code></pre>
</li>
<li>Возвращаемся в WSocks VPN и нажимаем сочетание клавиш "Ctrl + V".</li>
<li>Кликаем на подписку и на клавиатуре нажимаем "Enter".</li>
<li>После этого рекомендуется изучить разделы "Базовые/Кастомные маршруты" самостоятельно или по видео инструкции выше.</li>
</ul><br>
<b>Всё! Теперь вы можете использовать WSocks VPN с минимальным ping в играх.</b><br><br>`
    },
    manualAndroid: {
      title: 'Инструкция для Android',
      content: `<b>Инструкция по установке и использованию WSocks VPN на базе V2RayTun для Android.</b><br><br>
<b>Ссылка на видео инструкцию: <a href="https://plvideo.ru/watch?v=P3biV6ti6j-7" class="link">https://plvideo.ru/watch?v=P3biV6ti6j-7</a></b><br><br>
<b>Для использования программы V2RayTun:</b><br><br>
<ul>
<li>Скачиваем V2RayTun по кнопке "Скачать" под сообщением</li>
<li>После установки нажимаем на кнопку "Импортировать конфиг".</li>
<li>После этого рекомендуется изучить параметры "Маршрутизация" и "Сервисы" самостоятельно или по видео инструкции выше.</li>
</ul><br>
<b>Всё! Теперь при нажатии кнопки "Подключиться" вы можете использовать WSocks VPN.</b><br><br>`
    },
    manualIOS: {
      title: 'Инструкция для iOS/MacOS',
      content: `<b>Инструкция по установке и использованию WSocks VPN на базе V2RayTun для iOS/MacOS.</b><br><br>
<b>Ссылка на видео инструкцию: <a href="https://plvideo.ru/watch?v=FPuHNLWI2VrA" class="link">https://plvideo.ru/watch?v=FPuHNLWI2VrA</a></b><br><br>
<b>Для использования программы V2RayTun:</b><br><br>
<ul>
<li>Скачиваем V2RayTun по кнопке "Скачать" под сообщением</li>
<li>После установки нажимаем на кнопку "Импортировать конфиг".</li>
<li>После этого рекомендуется изучить параметры "Маршрутизация" и "Сервисы" самостоятельно или по видео инструкции выше.</li>
</ul><br>
<b>Всё! Теперь при нажатии кнопки "Подключиться" вы можете использовать WSocks VPN.</b><br><br>`
    },
manualAndroidTV: {
      title: 'Инструкция для Android TV',
      content: key => `<b>Инструкция по установке и использованию WSocks VPN на базе V2RayTun для Android TV.</b><br><br>
<b>Ссылка на видео инструкцию:</b><br><br>
<ul>
<li>После покупки, бот выдаст вам ключ для подключения, который вы можете использовать в программе V2RayTun.</li>
</ul><br>
<b>Для использования программы V2RayTun:</b><br><br>
<ul>
<li>Скачиваем приложение V2RayTun из Google Play (На телевизор).</li>
<li>Скачиваем приложение Google TV из Google Play/App Store (На телефон).</li>
<li>Подключаем к одной сети телефон и телевизор (на один Wi-fi).</li>
<li>Заходим в приложение Google TV на телефоне и подключаемся к телевизору.</li>
<li>В правом нижнем углу нажимаем на белую иконку пульта.</li>
<li>В появившемся меню в правом верхнем углу нажимаем на иконку клавиатуры и ненадолго откладываем его.</li>
<li>Заходим в приложение V2RayTun на телевизоре</li>
<li>Нажимаем на кнопку "Управление".</li>
<li>В появившемся меню выбираем "Ручной ввод".</li>
<li>В появившееся окно вставляем ключ используя окно взаимодействия в телефоне.<br>
<pre><code><span class="clickable-key" onclick="navigator.clipboard.writeText(this.innerText).then(() => alert('Ключ скопирован')).catch(err => console.error('Ошибка:', err))">${key}</span></code></pre>
</li>
<li>В плашке "Запрос на подключение" нажимаем "Ок"</li>
</ul><br>
<b>Всё! Теперь по нажатии кнопки "Подключиться" вы можете использовать VPN.</b><br><br>
<b>Если вы хотите добавить программы которые должны/не должны подключаться через WSocks VPN:</b><br><br>
<ul>
<li>В приложении V2RayTun нажимаем на кнопку "Маршрутизация".</li>
<li>В открывшемся окне, в правом верхнем углу, нажимаем на кнопку для включения функции "Маршрутизация выбранных приложений".</li>
<li>Включаем пункт "Режим обхода" если хотим, чтобы выбранные приложения проходили через основную сеть, а не выбранные через сеть VPN.</li>
<li>Не включаем пункт "Режим обхода" если хотим, чтобы выбранные приложения проходили через сеть VPN, а не выбранные через основную сеть.</li>
<li>В поле поиска вводим название нужного нам приложения.</li>
<li>После выбора всех нужных приложений выходим из раздела "Маршрутизация".</li>
</ul><br>
<b>Всё! Теперь указанная вами программа будет/не будет подключаться через вашу основную сеть при включённом VPN!</b>`
    }
  }
};
