window.TEXTS = {
  terms: {
    title: 'Пользовательское соглашение',
    content: `<b>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ НА ИСПОЛЬЗОВАНИЕ VPN-СЕРВИСА</b><br><br>
<b>1. Общие положения</b><br><br>
1.1. Настоящее Пользовательское соглашение (далее – «Соглашение») регулирует отношения между пользователем (далее – «Пользователь») и владельцем VPN-сервиса (далее – «Лицензиар»).<br>
1.2. VPN-сервис предоставляется исключительно в целях обеспечения безопасного соединения, защиты персональных данных и конфиденциальности информации Пользователя в сети Интернет.<br>
1.3. Пользователь обязан ознакомиться с условиями настоящего Соглашения перед началом использования VPN-сервиса. Использование VPN-сервиса означает полное согласие с условиями Соглашения.<br><br><br>
<b>2. Правовые основания использования VPN-сервиса</b><br><br>
2.1. Лицензиар осуществляет деятельность в соответствии с законодательством Российской Федерации, включая:<br><br>
Федеральный закон от 27 июля 2006 г. № 149-ФЗ «Об информации, информационных технологиях и о защите информации»;<br><br>
Федеральный закон от 6 июля 2016 г. № 374-ФЗ (пакет «Яровой»);<br><br>
Федеральный закон от 31 июля 2023 г. № 406-ФЗ «Об информации, информационных технологиях и о защите информации» и Федеральный закон «О связи»;<br><br>
Постановление от 12 февраля 2020 г. № 127 «Об утверждении Правил централизованного управления сетью связи общего пользования»;<br><br>
Федеральный закон от 29 июля 2017 г. № 276-ФЗ «О внесении изменений в Федеральный закон "Об информации, информационных технологиях и о защите информации"», устанавливающий запрет на использование информационно-телекоммуникационных сетей для доступа к запрещенным ресурсам;<br><br>
Приказ Роскомнадзора от 30 ноября 2024 г., запрещающий распространение научной, научно-технической и статистической информации о VPN-сервисах, используемых для обхода блокировок, за исключением информации, предназначенной для обеспечения безопасного удаленного доступа.<br><br>
2.2. Лицензиар не предоставляет доступ к ресурсам, запрещенным на территории Российской Федерации, и не предназначен для обхода блокировок, установленных органами государственной власти.<br>
2.3. Лицензиар оставляет за собой право ограничивать доступ к сервису в случаях нарушения законодательства Российской Федерации.<br><br><br>
<b>3. Ограничения и ответственность пользователя</b><br><br>
3.1. Пользователь обязуется:<br><br>
Не использовать VPN-сервис для обхода блокировок, установленных в соответствии с законодательством РФ.<br><br>
Не распространять противоправную информацию, включая экстремистские материалы, пропаганду насилия, наркотиков и другую запрещённую контентную информацию.<br><br>
Не осуществлять хакерскую деятельность, не нарушать работу информационных систем и не совершать кибератаки.<br><br>
Не использовать VPN-сервис для анонимного доступа к запрещённым ресурсам.<br><br>
3.2. В случае нарушения данных условий Лицензиар вправе приостановить или прекратить доступ к сервису без предварительного уведомления.<br><br><br>
<b>4. Политика конфиденциальности</b><br><br>
4.1. Лицензиар соблюдает требования законодательства РФ в области защиты персональных данных.<br>
4.2. Лицензиар не ведёт учёт действий Пользователей в сети Интернет, за исключением случаев, предусмотренных законодательством РФ.<br>
4.3. Лицензиар вправе передавать данные государственных органов Российской Федерации в случае поступления соответствующих запросов в порядке, установленным законом.<br><br><br>
<b>5. Ограничение ответственности</b><br><br>
5.1. Лицензиар не несёт ответственности за использование VPN-сервиса Пользователем в целях, противоречащих законодательству РФ.<br>
5.2. VPN-сервис предоставляется «как есть», без каких-либо гарантий работоспособности, доступности или совместимости с определёнными устройствами или программным обеспечением.<br>
5.3. Лицензиар не несёт ответственности за возможные технические сбои, вызванные действиями третьих лиц или проблемами на стороне Пользователя.<br><br><br>
<b>6. Заключительные положения</b><br><br>
6.1. Лицензиар оставляет за собой право вносить изменения в настоящее Соглашение в одностороннем порядке.<br>
6.2. Актуальная версия Соглашения размещается на официальных ресурсах Лицензиара.<br>
6.3. Вопросы, не урегулированные настоящим Соглашением, регулируются действующим законодательством Российской Федерации.<br><br>
<i>Дата последнего обновления: 10 февраля 2025 г.</i>`
  },
  setup: {
    manualPC: {
      title: 'Инструкция для ПК',
      content: email => `***Инструкция по установке и использованию WSocks VPN на базе WSocks VPN / NekoBox / Ray для Windows 10/11.***<br><br>
***Ссылка на видео инструкцию: <a href="https://plvideo.ru/watch?v=fGzKBtY-KmfW" class="link">https://plvideo.ru/watch?v=fGzKBtY-KmfW</a>***<br><br>
***Для использования программы WSocks VPN / NekoBox / Ray:***<br><br>
- Скачиваем zip файл для установки WSocks VPN по кнопке "Скачать" в самом низу.<br>
     - Переносим папку "WSocks-VPN--NekoBox--main" из zip архива в любое удобное место (на рабочий стол).<br>
     - Запускаем "WSocks VPN.exe" от имени администратора.<br>
     - Копируем ключ подключения:<br>
<pre><code>${email}</code></pre>
     - Возвращаемся в WSocks VPN и нажимаем сочетание клавиш "Ctrl + V".<br><br>
     - Кликаем на подписку и на клавиатуре нажимаем "Enter".<br><br>
        - После этого рекомендуется изучить разделы "Базовые/Кастомные маршруты" самостоятельно или по видео инструкции выше.<br><br>
***Всё! Теперь вы можете использовать WSocks VPN с минимальным ping в играх.***<br><br>`
    },
    manualAndroid: {
      title: 'Инструкция для Android',
      content: `***Инструкция по установке и использованию WSocks VPN на базе V2RayTun для Android.***<br><br>
***Ссылка на видео инструкцию: <a href="https://plvideo.ru/watch?v=P3biV6ti6j-7" class="link">https://plvideo.ru/watch?v=P3biV6ti6j-7</a>***<br><br>
***Для использования программы V2RayTun:***<br><br>
- Скачиваем V2RayTun по кнопке "Скачать" под сообщением<br><br>
- После установки нажимаем на кнопку "Импортировать конфиг".<br>
    - После этого рекомендуется изучить параметры "Маршрутизация" и "Сервисы" самостоятельно или по видео инструкции выше.<br><br>
***Всё! Теперь при нажатии кнопки "Подключиться" вы можете использовать WSocks VPN.***<br><br>`
    },
    manualIOS: {
      title: 'Инструкция для iOS/MacOS',
      content: `***Инструкция по установке и использованию WSocks VPN на базе V2RayTun для iOS/MacOS.***<br><br>
***Ссылка на видео инструкцию: <a href="https://plvideo.ru/watch?v=FPuHNLWI2VrA" class="link">https://plvideo.ru/watch?v=FPuHNLWI2VrA</a>***<br><br>
***Для использования программы V2RayTun:***<br><br>
- Скачиваем V2RayTun по кнопке "Скачать" под сообщением<br><br>
- После установки нажимаем на кнопку "Импортировать конфиг".<br>
    - После этого рекомендуется изучить параметры "Маршрутизация" и "Сервисы" самостоятельно или по видео инструкции выше.<br><br>
***Всё! Теперь при нажатии кнопки "Подключиться" вы можете использовать WSocks VPN.***<br><br>`
    },
    manualAndroidTV: {
      title: 'Инструкция для Android TV',
      content: email => `***Инструкция по установке и использованию WSocks VPN на базе V2RayTun для Android TV.***<br><br>
***Ссылка на видео инструкцию:***<br><br>
- После покупки, бот выдаст вам ключ для подключения, который вы можете использовать в программе V2RayTun.<br><br>
***Для использования программы V2RayTun:***<br><br>
- Скачиваем приложение V2RayTun из Google Play (На телевизор).<br>
- Скачиваем приложение Google TV из Google Play/App Store (На телефон).<br><br>
- Подключаем к одной сети телефон и телевизор (на один Wi-fi).<br>
     - Заходим в приложение Google TV на телефоне и подключаемся к телевизору.<br>
     - В правом нижнем углу нажимаем на белую иконку пульта.<br>
     - В появившемся меню в правом верхнем углу нажимаем на иконку клавиатуры и ненадолго откладываем его.<br><br>
- Заходим в приложение V2RayTun на телевизоре<br>
     - Нажимаем на кнопку "Управление".<br>
     - В появившемся меню выбираем "Ручной ввод".<br>
     - В появившееся окно вставляем ключ используя окно взаимодействия в телефоне.<br>
<pre><code>${email}</code></pre>
     - В плашке "Запрос на подключение" нажимаем "Ок"<br><br>
***Всё! Теперь по нажатии кнопки "Подключиться" вы можете использовать VPN.***<br><br>
***Если вы хотите добавить программы которые должны/не должны подключаться через WSocks VPN:***<br><br>
- В приложении V2RayTun нажимаем на кнопку "Маршрутизация".<br>
     - В открывшемся окне, в правом верхнем углу, нажимаем на кнопку для включения функции "Маршрутизация выбранных приложений".<br>
          - Включаем пункт "Режим обхода" если хотим, чтобы выбранные приложения проходили через основную сеть, а не выбранные через сеть VPN.<br>
          - Не включаем пункт "Режим обхода" если хотим, чтобы выбранные приложения проходили через сеть VPN, а не выбранные через основную сеть.<br>
     - В поле поиска вводим название нужного нам приложения.<br>
     - После выбора всех нужных приложений выходим из раздела "Маршрутизация".<br><br>
***Всё! Теперь указанная вами программа будет/не будет подключаться через вашу основную сеть при включённом VPN!***`
    }
  }
};
